add = "تفعيل"
disabl = "تعطيل"

setcreator = "^اضف منشى$|^اضف منشى @(.*)$|^اضف منشئ$|^اضف منشئ @(.*)$|^اضف منشئ [0-9]+$|اضف منشى [0-9]+$"
setcreator2 = "^اضف منشئ [0-9]+$|اضف منشى [0-9]+$"
setacreator = "^اضف منشى اساسي$|^اضف منشى اساسي @(.*)$|^اضف منشئ اساسي$|^اضف منشئ اساسي @(.*)$|^اضف منشئ اساسي [0-9]+$|اضف منشى اساسي [0-9]+$"
setacreator2 = "^اضف منشئ اساسي [0-9]+$|اضف منشى اساسي [0-9]+$"
remacreator = "^حذف منشى اساسي$|^حذف منشى اساسي @(.*)$|^حذف منشئ اساسي$|^حذف منشئ اساسي @(.*)$|^حذف منشئ اساسي [0-9]+$|حذف منشى اساسي [0-9]+$"
remacreator2 = "^حذف منشئ اساسي [0-9]+$|حذف منشى اساسي [0-9]+$"

setcreator = "^اضف منشى$|^اضف منشى @(.*)$|^اضف منشئ$|^اضف منشئ @(.*)$|^اضف منشئ [0-9]+$|اضف منشى [0-9]+$"
setcreator2 = "^اضف منشئ [0-9]+$|اضف منشى [0-9]+$"
remcreator ="^حذف منشى$|^حذف منشى @(.*)$|^حذف منشئ$|^حذف منشئ @(.*)$|^حذف منشئ [0-9]+$|حذف منشى [0-9]+$"
remcreator2 ="^حذف منشئ [0-9]+$|حذف منشى [0-9]+$"
setsudos = "^اضف مطور$|^اضف مطور @(.*)$|^اضف مطور$|^اضف مطور @(.*)$|^اضف مطور [0-9]+$|اضف مطور [0-9]+$"
setsudos2 = "^اضف مطور [0-9]+$|اضف مطور [0-9]+$"
remsudos = "^حذف مطور$|^حذف مطور @(.*)$|^حذف مطور$|^حذف مطور @(.*)$|^حذف مطور [0-9]+$|حذف مطور [0-9]+$"
remsudos2 = "^حذف مطور [0-9]+$|حذف مطور [0-9]+$"
setasudo = "^اضف مطور اساسي ثانوي$|^اضف مطور ثانوي @(.*)$|^اضف مطور ثانوي$|^اضف مطور اساسي ثانوي @(.*)$|^اضف مطور ثانوي [0-9]+$|اضف مطور اساسي ثانوي [0-9]+$"
setasudo2 = "^اضف مطور ثانوي [0-9]+$|اضف مطور اساسي ثانوي [0-9]+$"
remasudo = "^حذف مطور ثانوي$|^حذف مطور ثانوي @(.*)$|^حذف مطور اساسي ثانوي$|^حذف مطور اساسي ثانوي @(.*)$|^حذف مطور ثانوي [0-9]+$|حذف مطور اساسي ثانوي [0-9]+$"
remasudo2 = "^حذف مطور اساسي ثانوي [0-9]+$|حذف مطور ثانوي [0-9]+$"

setadmin = "^اضف ادمن$|^اضف ادمن @(.*)$|اضف ادمن [0-9]+$"
setadmin2 = "^اضف ادمن [0-9]+$"
remadmin = "^حذف ادمن$|^حذف ادمن @(.*)$|حذف ادمن [0-9]+$"
remadmin2 = "^حذف ادمن [0-9]+$"
setvip = "^اضف مميز$|^اضف مميز @(.*)$|اضف مميز [0-9]+$"
setvip2 = "^اضف مميز [0-9]+$"
remvip = "^حذف مميز$|^حذف مميز @(.*)$|حذف مميز [0-9]+$"
remvip2 = "^حذف مميز [0-9]+$"

ban = "^حظر$|^حظر @(.*)$|^حضر$|^حضر @(.*)$|^حظر [0-9]+$|حضر [0-9]+$|طرد [0-9]+$|^طرد @(.*)$|^طرد$"
ban2 = "^حظر [0-9]+$|حضر [0-9]+$|طرد [0-9]+$"


banall = "^حظر عام$|^حظر عام @(.*)$|^حضر عام$|^حضر عام @(.*)$|^حظر عام [0-9]+$|حضر عام [0-9]+$"
ban2all = "^حظر عام [0-9]+$|حضر عام [0-9]+$"


TKall = "^كتم عام$|^كتم عام @(.*)$|^تقيد عام$|^تقيد عام @(.*)$|^كتم عام [0-9]+$|تقيد عام [0-9]+$"
TK2all = "^كتم عام [0-9]+$|تقيد عام [0-9]+$"

unTKall = "^الغاء كتم العام$|^الغاء كتم العام @(.*)$|^الغاء تقيد العام$|^الغاء تقيد العام @(.*)$|^الغاء كتم العام [0-9]+$|الغاء تقيد العام [0-9]+$"
unTK2all = "^الغاء كتم العام [0-9]+$|الغاء تقيد العام [0-9]+$"

FloodM = "^عدد التكرار [0-9]+$"
FloodT = "^زمن التكرار [0-9]+$"
unban = "^الغاء حظر$|^الغاء حظر @(.*)$|^الغاء حضر$|^الغاء حضر @(.*)$|^الغاء حظر [0-9]+$|الغاء حضر [0-9]+$"
unban2 = "^الغاء حظر [0-9]+$|الغاء حضر [0-9]+$"

unbanall = "^الغاء حظر العام$|^الغاء حظر العام @(.*)$|^الغاء حضر العام$|^الغاء حضر العام @(.*)$|^الغاء حظر العام [0-9]+$|الغاء حضر العام [0-9]+$"
unban2all = "^الغاء حظر العام [0-9]+$|الغاء حضر العام [0-9]+$"


TK = "^تقيد$|^تقيد @(.*)$|تقيد [0-9]+$"
TK2 = "تقيد [0-9]+$" 
unTK = "^الفاء تقيد$|^الغاء تقيد @(.*)$|الغاء تقيد [0-9]+$"
unTK2 = "الغاء تقيد [0-9]+$" 

mute = "^كتم$|^كتم @(.*)$|كتم [0-9]+$"
mute2 = "كتم [0-9]+$" 
unmute = "^الغاء كتم$|^الغاء كتم @(.*)$|الغاء كتم [0-9]+$"
unmute2 = "الغاء كتم [0-9]+$" 

bans = "^المحظورين$|^المحضورين$|^المطرودين$"
del_bans = "^مسح المحضورين$|مسح المحظورين$|^مسح المطرودين$"

block = "^منع (.*)$|^منع$"
block2 = "^منع (.*)$"

setmalk = "^اضف مالك$|^اضف مالك @(.*)$|^اضف مالك$|^اضف مالك @(.*)$|^اضف مالك [0-9]+$|اضف مالك [0-9]+$"
setmalk2 = "^اضف مالك [0-9]+$|اضف مالك [0-9]+$"
remmalk = "^حذف مالك$|^حذف مالك @(.*)$|^حذف مالك$|^حذف مالك @(.*)$|^حذف مالك [0-9]+$|حذف مالك [0-9]+$"
remmalk2 = "^حذف مالك [0-9]+$|حذف مالك [0-9]+$"


block = "^منع (.*)|^منع"
block2 ="^منع (.*)"
 
unblock = "^الغاء منع (.*)$|^الغاء منع$"
unblock2 = "^الغاء منع (.*)$"

Blocklist = "^قائمة المنع$|^قائمه المنع$"

admins = "^الادمنيه$|^الادمنية$"
vips = "^المميزين$"
owners = "^المدراء$"
sudosList = "^المطورين$|^مطورين$"
creators = "^المنشئين$|^المنشىين$|^المنشئ$|^المنشى$"
acreators = "^المنشئيين الاساسين$|^المنشئيين الاساسين$|^المنشئ الاساسي$|^المنشى الاساسي$|المنشئين الاساسين$"
malk = "^المالك$"
PROadmins = "^اضف الادمنيه$|^اضف الادمنية$"

asudoList = "^المطورين الاساسين$|^مطورين الاساسين$"


stL = "^قفل"
stU = "^فتح"
stC = "^الغاء"
stAd = "تفعيل "
stUd = "تعطيل "
startlock = "^قفل (.*)$|^فتح (.*)$|تفعيل (.*)$|^تعطيل (.*)$"
Lurl = "قفل الروابط"
Uurl = "فتح الروابط"
Lphoto = "قفل الصور"
Uphoto = "فتح الصور"
Lvoice = "قفل الصوت"
Uvoice = "فتح الصوت"
Lvideo = "قفل الفيديو"
Uvideo = "فتح الفيديو"
Ljoin = "قفل الاشعارات"
Ujoin = "فتح الاشعارات"
Linline = "قفل الانلاين"
Uinline = "فتح الانلاين"
Lchat = "قفل الدردشه"
Uchat = "فتح الدردشه"
Lcontact = "قفل الجهات"
Ucontact = "فتح الجهات"
Ledits = "قفل التعديل"
Uedits = "فتح التعديل"
Lusername = "قفل المعرف"
Uusername = "فتح المعرف"
Ltag = "قفل التاك"
Utag = "فتح التاك"
Lgifs = "قفل المتحركه"
Ugifs = "فتح المتحركه"
Lfiles = "قفل الملفات"
Ufiles = "فتح الملفات"
Lsticker = "قفل الملصقات"
Usticker = "فتح الملصقات"
Lmusic = "قفل الاغاني"
Umusic = "فتح الاغاني"
Llongtext = "قفل الكلايش"
Ulongtext = "فتح الكلايش"
Lflood = "تفعيل التكرار"
Uflood = "تعطيل التكرار"
Larabic = "قفل العربيه"
Uarabic = "فتح العربيه"
Lenglish = "قفل الانكليزيه"
Uenglish = "فتح الانكليزيه"
Lbots = "قفل البوتات"
Ubots = "فتح البوتات"
Lmarkdown = "قفل الماركداون"
Umarkdown = "فتح الماركداون"
Lfwd = "قفل التوجيه"
Ufwd = "فتح التوجيه"
Lpin = "تفعيل التثبيت"
Upin = "تعطيل التثبيت"
Lall = "قفل الكل"
Uall = "فتح الكل"
Lnote = "قفل الملاحظة"
Unote = "فتح الملاحظة"

LwelcomeSend = "تفعيل الترحيب"
UwelcomeSend = "تعطيل الترحيب"

Lreply = "تفعيل الردود"
Ureply = "تعطيل الردود"

Laudo = "تفعيل التلقائي"
Uauto = "تعطيل التلقائي"

Lleave = "تفعيل المغادره"
Uleave = "تعطيل المغادره"

Lshowlink = "تفعيل الرابط"
Ushowlink = "تعطيل الرابط"

Lkickban = "^تفعيل (الطرد|الحضر|الحظر)$"
Ukickban = "^تعطيل (الطرد|الحضر|الحظر)$"



Lkickme = "تفعيل اطردني"
Ukickme = "تعطيل اطردني"

LreplyBOT = "تفعيل ردود البوت"
UreplyBOT = "تعطيل ردود البوت"

LID = "تفعيل الايدي"
UID = "تعطيل الايدي"


LIDPH = "^تفعيل الايدي بصورة$|^تفعيل الايدي بصوره$|^تفعيل الايدي بالصورة$|^تفعيل الايدي بالصوره$"
UIDPH = "^تعطيل الايدي بصورة$|^تعطيل الايدي بصوره$|^تعطيل الايدي بالصورة$|^تعطيل الايدي بالصوره$"

settingsCmd = "الاعدادات"

STlink = "الروابط"
STphoto = "الصور"
STvoice = "الصوت"
STvideo = "الفيديو"
STjoin = "الاشعارات"
STinline = "الانلاين"
STchat = "الدردشه"
STcontact = "الجهات"
STedits = "التعديل"
STusername = "المعرف"
STtag = "التاك"
STgifs = "المتحركه"
STfiles = "الملفات"
STsticker = "الملصقات"
STmusic = "الاغاني"
STlongtext = "الكلايش"
STflood = "التكرار"
STarabic = "العربيه"
STenglish = "الانكليزيه"
STbots = "البوتات"
STmarkdown = "الماركداون"
STfwd = "التوجيه"
STpin = "التثبيت"

STwelcomeSend = "الترحيب"
STReplySend = "الردود"
STReplySendBOT = "ردود البوت"
STkickme = "اطردني"
STIDSend = "الايدي"

STall = "الكل"
STnote = "الملاحظة"
STword = "الكلمات"
STbanall = "المحظورين عام"
STtkall = "المكتومين عام"

STprivates = "المحادثات"
STgroup = "المجموعات"

STWEL = "^وضع ترحيب (.*)"

STreply = "^اضف رد (.*)"
DLreply = "^حذف رد (.*)"
RPreply = "اضف رد "
RPdreply = "حذف رد "

STreplyBOT = "^اضف للبوت (.*)"
DLreplyBOT = "^حذف للبوت (.*)"
RPreplyBOT = "اضف للبوت "
RPdreplyBOT = "حذف للبوت "

RPwel = "وضع ترحيب "
RPbk = "منع "
RPubk = "الغاء منع "


Replylist= "^قائمة الردود$|^قائمه الردود$|^الردود$"

ReplylistBOT= "^قائمة ردود البوت$|^قائمه ردود البوت$|^ردود البوت$"


Alllist = "^قوائم العام$"

setname = "^وضع اسم (.*)$"
Dsetname = "وضع اسم "

setabout= "^وضع وصف (.*)$"
Dsetabout = "وضع وصف "

setphoto = "^وضع صوره|^وضع صورة$"

mymsgs = "رسائلي"

myedits = "سحكاتي"

myaddcontact = "جهاتي"

userinfo = "معلومات [0-9]+$"

kickme = "اطردني"
ID = "ايدي"

ShowSudos = "^مطور$|^المطور$|^مطورين$|^المطورين$|^مطور البوت$|^مطور بوت$"
setSudoC = "^وضع امر المطور (.*)"
RsetSudoC = "وضع امر المطور "

pinmsg = "^تثبيت$"
unpinmsg = "^الغاء تثبيت$"

stats = "^الاحصائيات$|^المجموعات$"

SETlink = "^وضع رابط ([Hh][Tt][Tt][Pp][Ss]:/|[Hh][Tt][Tt][Pp]://)(.*)"
RPlink = "وضع رابط "
link = "الرابط"

sendall = "^اذاعة$|^اذاعه$"
fwdall = "^توجية$|^توجيه$"

showGPS = "^روابط المجموعات$"

Setauto = "عدد التلقائي [0-9]+$"

leaveChat = "^(مغادرة|مغادره) -(.*)$"
leaveChatS = "^مغادرة$|^مغادره$"

deleteDeleted = "^طرد المحذوفين$" 

ShowO = "^الاوامر$"

idus = "^ايدي @(.*)$"



setIDC = "^(تعين الايدي|تعين ايدي|وضع ايدي|وضع الايدي) ((.|\n)*)"
RsetIDC = "تعين الايدي "
delIDC = "^مسح الايدي$"
LIDpt = "تفعيل الايدي بالازرار"
UIDpt = "تعطيل الايدي بالازرار"
deletebots = "^طرد البوتات$"


Ubot = "تحديث البوت"

settingsCmdRes = "^اعدادات التقيد$|^الاعدادات بالتقيد$|^اعدادات التقييد$|^الاعدادات بالتقييد$"
delrpmsg = "مسح"

sors = "^سورس$|^السورس$"

dellink = "^رابط حذف$|^رابط الحذف$"
dellink2 = "رابط الحذف"

floodset = "^وضع التكرار$"


remallR= "^حذف الكل$|^حذف الكل @(.*)$|حذف الكل [0-9]+$"
remallR2= "^حذف الكل [0-9]+$"
deletebans = "^تنظيف المحظورين$"
deleterks = "^تنظيف المقيدين$|^تنظيف المقيديين$|^تنظيف المقيدون$"

restricteds = "^المقيدون$|^المقيدين$|^المقيديين$"
del_restricteds = "^مسح المقيدين$|مسح المقيديين$|^مسح المقيدون$"

mutes = "^المكتومين$"
del_mutes = "^مسح المكتومين$"

tagall = "^تاك للكل$"
 
addor = "^اضف امر (.*)$"
orvip = "اضف مميز"
orad = "اضف ادمن"
orow = "اضف مدير"
ortk = "تقيد"
orban = "حظر"

Lbancheck = "تفعيل التحقق"
Ubancheck = "تعطيل التحقق"
STbancheck = "التحقق"

twostepset = "^وضع التحقق$"
setGPadmin = "^اضف ادمن بالكروب$|^اضف ادمن بالكروب @(.*)$|اضف ادمن بالكروب [0-9]+$"
setGPadmin2 = "^اضف ادمن بالكروب [0-9]+$"

delmsgs = "^تنظيف [0-9]+$"


del_ac = "^مسح المنشئين الاساسين$|^مسح المنشئيين الاساسين$"
del_cr = "^مسح المنشئين$|^مسح المنشئيين$"
del_ad = "^مسح الادمنيه$|^مسح الادمنية$"
del_vp = "^مسح الاعضاء المميزين$|^مسح المميزين$"

